In [1]:
import pandas as pd

In [2]:
a=[1,2,3,4,5]
b=[3,4,5,6,7]
c=[5,6,7,4,6]

In [3]:
#creating series
a=pd.DataFrame(a)

In [10]:
a['bb']=b

In [11]:
a

   0  2nd  bb
0  1    3   3
1  2    4   4
2  3    5   5
3  4    6   6
4  5    7   7

In [8]:
a['2nd']

0    1
1    2
2    3
3    4
4    5
Name: 0, dtype: int64

In [12]:
a.describe()

              0       2nd        bb
count  5.000000  5.000000  5.000000
mean   3.000000  5.000000  5.000000
std    1.581139  1.581139  1.581139
min    1.000000  3.000000  3.000000
25%    2.000000  4.000000  4.000000
50%    3.000000  5.000000  5.000000
75%    4.000000  6.000000  6.000000
max    5.000000  7.000000  7.000000

In [13]:
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       5 non-null      int64
 1   2nd     5 non-null      int64
 2   bb      5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [14]:
a.shape

(5, 3)

In [16]:
a.iloc[1,:]

0      2
2nd    4
bb     4
Name: 1, dtype: int64

In [17]:
c=[0,1,0,1]
d=[0,1,1,0]

In [18]:
data=pd.DataFrame(c,d)

In [19]:
data

   0
0  0
1  1
1  0
0  1

In [22]:
data1

   0
0  0
1  1
2  0
3  1

In [25]:
data2=pd.DataFrame(c,columns=['actual'])

In [26]:
data2

   actual
0       0
1       1
2       0
3       1

In [27]:
data2['calculated']=d

In [28]:
data2

   actual  calculated
0       0           0
1       1           1
2       0           1
3       1           0

In [30]:
c1=[]
for i,j in zip(data2['actual'],data2['calculated']):
    if i==0 and j==0:
        c1.append('FN')
        print(i,j,c)
    elif i==1 and j==1:
        c1.append('TP')
        print(i,j,c)
    elif i==0 and j==1:
        c1.append('FP')
        print(i,j,c)
    else:
        c1.append('TN')
        print(i,j,c)
c1
data2['and']=c1

0 0 [0, 1, 0, 1, 'FN', 'TP', 'FP', 'TN']
1 1 [0, 1, 0, 1, 'FN', 'TP', 'FP', 'TN']
0 1 [0, 1, 0, 1, 'FN', 'TP', 'FP', 'TN']
1 0 [0, 1, 0, 1, 'FN', 'TP', 'FP', 'TN']

In [31]:
data2

   actual  calculated and
0       0           0  FN
1       1           1  TP
2       0           1  FP
3       1           0  TN

In [33]:
d1=[]
for i,j in zip(data2['actual'],data2['calculated']):
    if i==0 & j==0:
        d1.append('FN')
        print(i,j,d1)
    elif i==1 & j==1:
        d1.append('TP')
        print(i,j,d1)
    elif i==0 & j==1:
        d1.append('FP')
        print(i,j,d1)
    else:
        d1.append('TN')
        print(i,j,d1)
d1
data2['&']=d1

0 0 ['FN']
1 1 ['FN', 'TP']
0 1 ['FN', 'TP', 'FN']
1 0 ['FN', 'TP', 'FN', 'TN']

In [34]:
data2

   actual  calculated and   &
0       0           0  FN  FN
1       1           1  TP  TP
2       0           1  FP  FN
3       1           0  TN  TN